<div class="py-100 wrapper">
    <a href="/" text="18 $brand mono">{"<"} На головну</a>


    <h2><strong>Політика конфіденційності</strong></h2><p>Ця угода про конфіденційність розроблена відповідно до вимог Закону України «Про захист персональних даних» та інших нормативних актів українського законодавства, що регламентують правові відносини, пов'язані зі збиранням, обробкою, зберіганням персональних даних, а також правом громадян на невтручання в особисте життя та правом на самовираження.
    </p><p>Сайт надання послуг «https://yogafaynyy.com», дбаючи про розвиток взаємовідносин з клієнтами, розуміючи важливість забезпечення охорони Ваших персональних даних, з метою вирішення можливих сперечань та непорозумінь підготувала цю Угоду про конфіденційність (політику конфіденційності), далі за текстом – «Політика конфіденційності» та умови користування веб-сайтом https://yogafaynyy.com, далі за текстом – сайт. Будь ласка, уважно прочитайте цю сторінку. інформація, викладена на ній, є важливою для Вас як для Користувача сайту.
    </p><h3><strong>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</strong></h3><p>1.1 У цій Політиці конфіденційності використовуються такі терміни: </p><p>1.1.1. «Адміністрація сайту» – уповноважені співробітники на управління сайтом, що діють від імені сайту «https://yogafaynyy.com», які організовують обробку персональних даних, а також визначає цілі обробки персональних даних, склад персональних даних, що підлягають обробці, дії чи операції, що здійснюються з персональними даними.
    </p><p>1.1.2. "Персональні дані" - будь-яка інформація, що стосується прямо або опосередковано до певної або визначеної фізичної особи (суб'єкта персональних даних).
    </p><p>1.1.3. «Обробка персональних даних» - будь-яка дія (операція) або сукупність дій (операцій), що здійснюються з використанням засобів автоматизації або без використання таких засобів з персональними даними, включаючи збирання, запис, систематизацію, накопичення, зберігання, уточнення (оновлення, зміну), вилучення, використання, передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних.
    </p><p>1.1.4. «Конфіденційність персональних даних» - обов'язкова для дотримання Адміністратором або іншою особою, яка отримала доступ до персональних даних, вимога не допускати їх розповсюдження без згоди суб'єкта персональних даних або наявності іншої законної підстави.
    </p><p>1.1.5. «Користувач сайту «https://yogafaynyy.com» – особа, яка має доступ до Сайту, через мережу Інтернет та використовує Сайт інтернет-магазину.
    </p><p>1.1.6. "Cookies" — невеликий фрагмент даних, надісланий веб-сервер і зберігається на комп'ютері користувача, який вебклієнт або веб-браузер щоразу пересилає веб-сервер в HTTP-запиті, намагаючись відкрити сторінку відповідного сайту. </p><p>1.1.7. IP-адреса — унікальна мережна адреса вузла в комп'ютерній мережі, побудованій за протоколом IP.
    </p><h3><strong>2.ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</strong></h3><p>2.1. Користуючись сайтом або купуючи товар, пропонований на сайті, а також відповідаючи на необхідні питання в анкеті при реєстрації та/або оформленні покупки, користувач підтверджує, що дає згоду сайту «https://yogafaynyy.com» та уповноваженим ним особам на обробку персональних даних, а також що є повнолітньою особою. </p><p>2.2. Користувач дає свою згоду Адміністрація сайту на обробку отриманої інформації, включаючи збирання, систематизацію, накопичення, зберігання, уточнення (оновлення, виправлення), використання, розповсюдження, знеособлення, блокування, знищення персональних даних, зазначених в анкеті, з метою заходів, спрямованих на формування бази даних учасників, складання статистичної звітності, проведення маркетингових досліджень, а також здійснення взаємодії з користувачем, у тому числі через мережі електрозв'язку, включаючи направлення SMS-повідомлень та електронних листів, до відкликання такої згоди.
    </p><p>2.3. Користувач підтверджує свою згоду з тим, що Адміністрація сайту має право взаємодіяти з Користувачем шляхом здійснення прямих контактів за допомогою різних засобів зв'язку, включаючи, але не обмежуючись: поштове розсилання, електронна пошта, мережа Інтернет та ін.
    </p><p>2.4. Персональні дані, дозволені для обробки в рамках цієї Політики конфіденційності, включають, але не обмежуються наступною інформацією:
    </p><p>2.4.1. ПІБ Користувача;
    </p><p>2.4.2. Контактний телефон Користувача;
    </p><p>2.4.3. Адреса електронної пошти (e-mail);
    </p><p>2.4.4. Адреса доставки Товару; 2.4.5. місце проживання Користувача.
    </p><h3><strong>3.МЕТА ЗБОРУ ТА ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ</strong></h3><p>3.1. Персональну інформацію Користувача Сайту https://yogafaynyy.com використовує з цією метою:
    </p><p>3.1.1. ідентифікації Користувача, зареєстрованого на сайті, для оформлення замовлення та (або) укладання Договору купівлі-продажу товару дистанційним способом із Сайтом «https://yogafaynyy.com».
    </p><p>3.1.2. надання Користувачеві ефективної клієнтської підтримки;
    </p><p>3.1.3. надання Користувачеві персоналізованих сервісів;
    </p><p>3.1.4. зв'язку з Користувачем, у тому числі направлення повідомлень, запитів та інформації щодо використання Сервісів, надання послуг, а також обробки запитів та заявок від Користувача;
    </p><p>3.1.5. покращення якості Сервісів, зручності їх використання, розробка нових Сервісів та послуг;
    </p><p>3.1.6. надання інформації про товари, послуги, що реалізуються на сайті «https://yogafaynyy.com», про рекламні акції, що проводяться на сайті «https://yogafaynyy.com», відповіді на запити, а також виконання сайтом «https://yogafaynyy.com» своїх зобов'язань перед споживачами товарів (послуг);
    </p><p>3.1.7. проведення статистичних та інших досліджень на основі знеособлених даних.
    </p><h3><strong>4.КАТЕГОРІЇ ЗДАНИХ ДАНИХ</strong></h3><p>4.1.Категорії Персональні дані, збирання яких здійснює сайт (самостійно або за посередництвом третіх осіб), включають: Файли cookie та Дані про використання мережних ресурсів.
    </p><p>4.2. Персональні дані можуть надаватися Користувачем самостійно або їх збір може автоматично здійснювати сайт при його використанні. Якщо не вказано інше, сайт https://yogafaynyy.com використовує файли cookie (або інші засоби відстеження) для ідентифікації Користувачів та запам'ятовування встановлених ними глобальних параметрів налаштування виключно з метою надання послуги, яка потрібна Користувачеві.
    </p><p>4.3. Користувачі несуть відповідальність за Персональні дані третіх осіб, які вони отримують, публікують або надають іншим особам, використовуючи сайт, і підтверджують, що вони мають згоду третьої особи на надання Даних Власнику. </p><h3><strong>5. СПОСОБИ ТА ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ</strong></h3><p>5.1. Обробка персональних даних Користувача здійснюється без обмеження терміну будь-яким законним способом, у тому числі в інформаційних системах персональних даних з використанням засобів автоматизації або без використання таких засобів.
    </p><p>5.2. Користувач погоджується з тим, що Адміністрація сайту має право передавати персональні дані третім особам, зокрема кур'єрським службам, організаціям поштового зв'язку, оператором електрозв'язку, виключно з метою виконання замовлення Користувача, оформленого на Сайті «https://yogafaynyy.com», включаючи доставку Товару.
    </p><h3><strong>6. ПРАВА КОРИСТУВАЧІВ</strong></h3><p>6.1. Користувачі мають право:
    </p><p>6.1.1. дізнатися, чи були збережені їх особисті дані;
    </p><p>6.1.2. звертатися до Адміністрації сайту, щоб дізнатися про їх зміст та походження;
    </p><p>6.1.3. перевірити їхню вірогідність або попросити їх доповнити;
    </p><p>6.1.4. видалити, оновити або виправити особисті дані;
    </p><p>6.1.5. перетворити на формат, що забезпечує анонімність; </p><p>6.1.6. блокувати будь-які дані, що зберігаються порушуючи закон; </p><p>6.1.7 виступити проти їх обробки з усіх без винятку законних підстав.
    </p><p>6.2. Відповідні запити слід надсилати адміністрації сайту на адресу, вказану в контактних відомостях на сайті.
    </p><h3><strong>7. ПОЛІТИКА ЩОДО ФАЙЛІВ COOKIE</strong></h3><p>7.1. Сайт збирає інформацію про відвідування Вами наших вебсайт з метою отримання статистики відвідувань та ефективності їх використання, формування персонального підходу та адаптації до інтересів кожного користувача. Ми робимо це за допомогою різних технологій, одна з яких – cookie-файли. Це дані, які вебсайт може надіслати вашому браузеру, і вони будуть збережені на вашому комп'ютері для подальшої ідентифікації його вебсайт.
    </p><p>7.2. Cookie-файли використовуються для оцінки ефективності веб-сайт (наприклад, для вимірювання кількості відвідувачів та тривалості їх перебування на сайті), виявлення найцікавіших та відвідуваних тем та сторінок, а також для забезпечення зручності навігації та користування сайтом, без збору будь-якої персональної інформації. Також cookie-файли можуть бути використані для формування персонального підходу на основі вже наявного досвіду взаємодії користувача з сайтом та його перевагами. З часом ця інформація дозволяє поліпшити досвід користувача.
    </p><h3><strong>8. БЕЗПЕКА ПЕРСОНАЛЬНИХ ДАНИХ</strong></h3><p>8.1. Сайт «https://yogafaynyy.com» вживає необхідних організаційних та технічних заходів для захисту персональної інформації Користувача від неправомірного або випадкового доступу, знищення, зміни, блокування, копіювання, розповсюдження, а також від інших неправомірних дій третіх осіб. </p><p>8.2. Ця Політика конфіденційності поширюється лише на сайт «https://yogafaynyy.com». Якщо за посиланнями, розміщеними на сайті останнього, Користувач зайде на ресурси третіх осіб, то Інтернет-магазин за його дії відповідальності не несе. </p><p>8.3. Персональні дані Користувача можуть бути використані в юридичних цілях у суді або на етапах, що ведуть до можливого звернення до суду через те, що сайт або послуги використовувались неналежним чином. Користувач обізнаний, що адміністрація сайту може бути змушена повідомити персональні дані на вимогу органів державної влади.
    </p><h3><strong>9. ДОДАТКОВА ІНФОРМАЦІЯ ПРО ПЕРСОНАЛЬНІ ДАНІ КОРИСТУВАЧІ</strong></h3><p>9.1. Окрім інформації, що міститься в цих правилах забезпечення конфіденційності персональних даних, сайт може надавати Користувачеві за запитом додаткову та контекстуальну інформацію щодо конкретних послуг та сервісів або збору та обробки Персональних даних.
    </p><p>9.2. З метою забезпечення роботи сайту та його технічного обслуговування, сайт та будь-які сторонні сервіси можуть вести файли, в яких реєструється взаємодія сайту з Користувачами (системні журнали), або використовувати для цього інші Персональні дані (зокрема, IP-адресу). </p><h3><strong>10. ДОДАТКОВІ УМОВИ</strong></h3><p>10.1.Адміністрація сайту має право вносити зміни до цієї Політики конфіденційності без згоди Користувача. </p><p>10.2.Нова Політика конфіденційності набуває чинності з моменту її розміщення на Сайті інтернет-магазину, якщо інше не передбачено новою редакцією Політики конфіденційності.
    </p><p><strong>Посилання на інші сайти</strong></p><p>Наш сайт <strong>yogafaynyy@gmail.com</strong>може містити посилання на інші сайти, які не керуються нами. Ми не несемо відповідальність за їхній зміст. Ми рекомендуємо вам ознайомитися з політикою конфіденційності кожного сайту, який ви відвідуєте, якщо вона там є.
    </p><p><strong>Зміни в політиці конфіденційності</strong></p><p>Наш сайт <strong>yogafaynyy@gmail.com</strong>може оновлювати нашу політику конфіденційності час від часу. Ми повідомляємо про будь-які зміни, розмістивши нову політику конфіденційності на цій сторінці. </p><p>Ми відстежуємо зміни законодавства, що стосується персональних даних у в державі Україна. Якщо ви залишили персональні дані у нас, то ми сповістимо вас про зміну в політиці конфіденційності. Якщо ваші персональні дані були введені некоректно, то ми не зможемо з вами зв'язатися.
    </p>
    <br>
    <br>
    <p>
        Пропозиції щодо співпраці, питання та побажання надсилайте на пошту: 
        <a href="mailto:yogafaynyy@gmail.com">
            <strong>yogafaynyy@gmail.com</strong>
        </a>
    </p>




</div>

<style>
    * {
        line-height: 1.5;
        
    }

    p {
        font-weight: 300;
    }

    h1 { font-size: 32px; margin-top: 20px; margin-bottom: 24px; }
    h2 { font-size: 28px; margin-top: 20px; margin-bottom: 20px; }
    h3 { font-size: 24px; margin-top: 20px; margin-bottom: 15px; }
    h4 { font-size: 20px; margin-top: 20px; margin-bottom: 10px; }
    h5 { font-size: 18px; margin-top: 20px; margin-bottom: 8px; }
    h6 { font-size: 16px; margin-top: 20px; margin-bottom: 5px; }

    a {
        color: var(--brand);
    }

    strong::after {
        content: ' ';
    }
</style>