<div class="py-100 wrapper">
    <a href="/" text="18 $brand mono" class="block mb-40">{'<'} На головну</a>

    <h2>ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ НА ПЛАТНЕ НАДАННЯ ПОСЛУГ НАВЧАННЯ</h2>
    <p><strong>Україна, Київ</strong></p>
    <p>
        Цей договір, в якому одна сторона Фізична особа-підприємець Москалець
        Сергій Романович (надалі – Виконавець), яка є платником єдиного податку
        3-ї групи, з одного боку, і будь-яка особа, яка прийняла (акцептувала)
        дану пропозицію (надалі – Замовник), з іншого боку, далі разом
        іменуються як Сторони, уклали даний договір (далі — Договір) адресований
        необмеженому колу осіб, який являється офіційною публічною пропозицією
        Виконавця, укласти з Замовниками договір надання послуг навчання, опис
        яких розміщений у відповідному розділі сайту https://yogafaynyy.com,
        приймають умови цього Договору про нижченаведене:
    </p>
    <p>
        <br />
    </p>
    <h3>1.ЗАГАЛЬНІ ПОЛОЖЕННЯ</h3>
    <p>
        1.1. Договірні відносини між Виконавцем і Замовником оформляються у
        вигляді Договору публічної оферти. Натискання в інтернет-ресурсі на
        сторінці оформлення кнопки “ПЕРЕЙТИ ДО ОПЛАТИ”, означає, що Замовник,
        незалежно від статусу (фізична особа, юридична особа, фізична особа —
        підприємець), згідно чинного українського законодавства, взяв до
        виконання умови Договору публічної оферти, які вказані нижче.
    </p>
    <p>
        1.2. Договір публічної оферти є публічним, тобто відповідно до статей
        633, 641 Цивільного кодексу України його умови однакові для всіх
        Замовників незалежно від статусу (фізична особа, юридична особа, фізична
        особа — підприємець). При повній згоді з даним Договором, Замовник
        приймає умови, порядок оформлення Замовлення та оплати і надання послуг
        Виконавцем, відповідальності за недобросовісне Замовлення і за
        невиконання умов цього Договору.
    </p>
    <p>
        <br />
    </p>
    <h3>2.ТЕРМІНИ І ВИЗНАЧЕННЯ</h3>
    <p>
        «Договір публічної оферти» - публічний договір, зразок якого розміщений
        на Веб-сайті https://yogafaynyy.com і застосування якого є обов’язковим
        для всіх третіх осіб, що містить пропозицію Виконавця, щодо надання
        Послуг, опис яких знаходиться на Веб-сайті Виконавця, спрямованих
        невизначеному колу осіб, у тому числі Замовникам.
    </p>
    <p>
        «Акцепт» - прийняття Замовником пропозиції Виконавця щодо придбання
        Послуг, опис яких знаходиться на Веб-сайті Виконавця
        https://yogafaynyy.com, шляхом купівлі послуги.
    </p>
    <p>
        «Оферта» - цей документ «Договір публічної оферти на оплатне надання
        послуг навчання», розміщений у мережі інтернет за адресою
        https://yogafaynyy.com
    </p>
    <p>
        «Послуга» - послуги навчання, інформація про які розміщена на Веб-сайті
        https://yogafaynyy.com. Послуги можуть надаватися за допомогою засобів
        телекомунікаційного, електронного зв’язку (в тому числі через мережу
        інтернет).
    </p>
    <p>
        «Замовник» - будь-яка дієздатна фізична, юридична особа, фізична
        особа-підприємець, згідно чинного українського законодавства, що
        відвідали Веб-сайт https://yogafaynyy.com та мають намір придбати ту чи
        іншу Послугу.
    </p>
    <p>
        «Виконавець» - фізична особа-підприємець, яка є власником чи
        розповсюджувачем Послуг згідно чинного українського законодавства за
        допомогою Веб-сайту https://yogafaynyy.com та має намір їх
        надавати/продавати.
    </p>
    <p>
        «Договір» - договір між Замовником і Виконавцем на надання Послуг, який
        укладається за допомогою Акцепту Оферти.
    </p>
    <p>
        «Замовлення» - належно оформлена та розміщена на Веб-сайті Виконавця
        особиста сторінка Замовника на купівлю Послуг, що адресується Виконавцю
        та за допомогою якого платіжною системою генерується Рахунок-фактура до
        сплати.
    </p>
    <p>
        «Законодавство» - чинне законодавство України, яке може бути застосоване
        до правовідносин, пов’язаних з виконанням та/або які виходять з
        виконання описаних в цьому Договорі зобов'язань.
    </p>
    <p>
        <br />
    </p>
    <h3>3.ПРЕДМЕТ ДОГОВОРУ</h3>
    <p>
        3.1. Предметом Договору є платне надання Виконавцем Замовнику Послуг на
        умовах Оферти.
    </p>
    <p>
        3.2. Виконавець та Замовник підтверджують, що чинний Договір не є
        фіктивною чи удаваною угодою або угодою, укладеною під впливом тиску чи
        обману.
    </p>
    <p>
        3.3. Виконавець підтверджує, що діє згідно з вимогами діючого
        законодавства України.
    </p>
    <p>
        <br />
    </p>
    <h3>4.ПРАВА ТА ОБОВ'ЯЗКИ ВИКОНАВЦЯ</h3>
    <h3>4.1. Виконавець зобов’язаний:</h3>
    <p>
        a. при наданні Послуги Виконавець зобов’язаний дотримуватись умов
        Оферти;
    </p>
    <p>
        b. виконувати замовлення Замовника в разі надходження оплати від
        Замовника;
    </p>
    <p>
        c. надати Замовнику Послуги згідно з пропозиціями і описами на
        відповідній сторінці Веб-сайту https://yogafaynyy.com, оформленим
        Замовленням і умовами даного Договору;
    </p>
    <h3>4.2. Виконавець має право:</h3>
    <p>
        a: в односторонньому порядку призупинити надання послуг за цим Договором
        у випадку порушення Замовником умов цього Договору;
    </p>
    <p>
        b. Виконавець має право залучати третіх осіб для виконання своїх
        зобов’язань з надання Послуг за Договором;
    </p>
    <p>
        c. Виконавець має право змінити Оферту, як це передбачено в п. 8.3 цієї
        Оферти;
    </p>
    <p>
        d. Виконавець має право публікувати та поширювати інформацію про хід,
        спосіб та результати надання Послуг Замовнику.
    </p>
    <p>
        <br />
    </p>
    <h3>5.ПРАВА ТА ОБОВ'ЯЗКИ ЗАМОВНИКА</h3>
    <h3>5.1. Замовник зобов’язаний:</h3>
    <p>a. своєчасно оплатити і отримати замовлення на умовах цього Договору;</p>
    <p>
        b. ознайомитись з інформацією про Послуги, яка розміщені на сайті
        Виконавця;
    </p>
    <p>
        Протягом терміну дії цього Договору і протягом 20 (двадцяти) років з
        моменту його припинення за будь-якої причини, Виконавець тримає в
        конфіденційності всю інформацію, отриману у зв’язку з укладенням та
        виконанням цього Договору (далі — «Конфіденційна інформація») і
        утримується від розкриття такої інформації третім особам, за винятком,
        коли це вимагається згідно з українським законодавством або будь-яким
        відповідним національним або міжнародним регулюючим органом.
    </p>
    <p>
        Замовник не має права продавати, ліцензувати, субліцензувати, передавати
        або іншим чином розголошувати будь-яку конфіденційну інформацію отриману
        від Виконавця третім особам, за винятком випадків, прямо передбачених
        цим Договором;
    </p>
    <p>
        Замовник гарантує, що пов’язані з ним треті особи, його співробітники та
        професійні консультанти, які мають доступ до конфіденційної інформації,
        зобов’язані приймати зобов’язання конфіденційності, не менше суворі, ніж
        ті, що описані тут.
    </p>
    <h3>5.2. Замовник має право:</h3>
    <p>
        a. оформити Замовлення на відповідній сторінці Веб-сайту
        https://yogafaynyy.com;
    </p>
    <p>
        b. ознайомитись з описом Послуг на відповідній сторінці Веб-сайту
        https://yogafaynyy.com.
    </p>
    <h3>6.ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</h3>
    <p>
        6.1. Замовник самостійно оформлює Замовлення на відповідній сторінці
        Веб-сайту https://yogafaynyy.com шляхом вибору функції “Перейти до
        оплати”, отримання від платіжної системи можливості оплатити послугу на
        розрахунковий рахунок Виконавця.
    </p>
    <p>
        <br />
    </p>
    <h3>7.ЦІНА ДОГОВОРУ І ПОРЯДОК ОПЛАТИ</h3>
    <p>
        7.1. Ціна кожної окремої Послуги визначається Виконавцем та зазначається
        на відповідній сторінці Веб-сайту https://yogafaynyy.com
    </p>
    <p>
        7.2. Вартість Замовлення може змінюватись в залежності від ціни,
        кількості чи номенклатури Послуг.
    </p>
    <h3>7.3. Замовник може оплатити Замовлення наступними способами:</h3>
    <p>
        a.за допомогою банківського переказу грошей на поточний рахунок
        Виконавця;
    </p>
    <p>b.іншим способом за домовленістю з Виконавцем.</p>
    <p>
        7.4. Послуги вважаються сплаченими Замовником з моменту отримання
        Виконавцем підтвердження з банку про надходження всієї суми оплати на
        поточний рахунок Виконавця. В окремих випадках, на власний розсуд
        Виконавця, підтвердженням факту оплати може бути:
    </p>
    <p>а. копія платіжного доручення у разі безготівкової форми оплати;</p>
    <p>
        b. копія квитанції про оплату з печаткою банку, через який здійснено
        оплату;
    </p>
    <p>c. копія квитанції терміналу, тощо.</p>
    <h3>7.5. Умови повернення коштів:</h3>
    <p>за 7 днів до першого класу - повертаємо 100% оплати;</p>
    <p>за 6 – 1 день до першого класу - повертаємо 50% оплати;</p>
    <p>після початку занять - оплата не повертається.</p>
    <p>
        <br />
    </p>
    <h3>8. СТРОК ДІЇ ТА ЗМІНА УМОВ ОФЕРТИ</h3>
    <p>
        8.1.Виконавець починає надавати послуги за цим Договором в дату початку
        надання послуг.
    </p>
    <p>
        8.2.Договір укладається на невизначений термін та набуває чинності з
        моменту натискання на кнопку “ПЕРЕЙТИ ДО ОПЛАТИ”, цим Замовник надає
        згоду здійснити покупку наявних у Виконавця Послуг та діє до моменту
        отримання Замовником Послуг від Виконавця і повного розрахунку за ними.
    </p>
    <p>
        8.3.Виконавець залишає за собою право внести зміни в умови Оферти та/або
        відкликати Оферту в будь-який момент на власний розсуд. У разі внесення
        Виконавцем змін в Оферту такі зміни набувають чинності з моменту
        розміщення зміненого тексту Оферти в мережі інтернет за зазначеною в п.
        2 Договору адресою, якщо інший строк набуття чинності змін не визначено
        додатково під час такого розміщення.
    </p>
    <p>
        8.4.Якщо Рахунок-фактура на оплату, згенерований на основі Замовлення,
        не оплачений Замовником протягом 5 банківських днів в повному обсязі,
        Договір може бути розірваним Виконавцем в односторонньому порядку, без
        повідомлення про таке розірвання Замовника.
    </p>
    <p>
        <br />
    </p>
    <h3>9.ВІДПОВІДАЛЬНІСТЬ СТОРІН ТА ВИРІШЕННЯ СПОРІВ</h3>
    <p>
        9.1. відповідають за невиконання або неналежне виконання умов цього
        Договору в порядку, передбаченому цим Договором і чинним законодавством
        України.
    </p>
    <p>
        9.2. Виконавець не несе жодної відповідальності перед Замовником, якщо
        Замовник:
    </p>
    <p>а) порушив строки та умови оплати за цим Договором та/або</p>
    <p>
        b) не скористався послугами Виконавця у терміни, які повідомив
        Виконавець на відповідній сторінці Веб-сайту https://yogafaynyy.com
        та/або електронною поштою та/або іншими засобами телекомунікаційного
        зв’язку;
    </p>
    <p>
        9.3. Виконавець не несе відповідальності перед Замовником за будь-які
        прямі або непрямі збитки, які сталися через: використання або
        неможливості використання Послуги, ресурсів сайту https://yogafaynyy.com
        та/або окремих сервісів Виконавця; заяви або поведінку будь-якої третьої
        особи під час одержання Послуги.
    </p>
    <p>
        9.4. У разі виникнення спорів, пов’язаних з виконанням Сторонами цього
        Договору, за винятком спорів щодо стягнення заборгованості з Замовника,
        Сторони зобов’язуються вирішувати їх шляхом переговорів з дотриманням
        претензійного порядку. Термін розгляду претензії - 7 (сім) календарних
        днів від дати її отримання. По спорах у зв’язку із стягненням
        заборгованості з Замовника дотримання претензійного порядку не потрібно.
    </p>
    <p>
        9.5. Усі спори, розбіжності або вимоги, що виникають з цього Договору
        або у зв’язку з ним, у тому числі що стосуються його виконання,
        порушення, припинення або недійсності, підлягають вирішенню у
        відповідному суді згідно з матеріальним і процесуальним правом України.
    </p>
    <p>
        9.6. Сукупний розмір відповідальності Виконавця за Договором, включаючи
        розмір штрафних санкцій (пені, штраф) та/або відшкодовуваних збитків за
        будь-яким позовом або претензією відносно Договору чи його виконання,
        обмежується 1% вартості Послуг за Договором.
    </p>
    <p>
        <br />
    </p>
    <h3>10. ФОРС-МАЖОРНІ ОБСТАВИНИ ТА ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ</h3>
    <p>
        10.1. Сторони не несуть відповідальності за невиконання будь-якого зі
        своїх зобов’язань, за винятком зобов’язань по оплаті, якщо доведуть, що
        таке невиконання було викликано форс-мажорними обставинами та/або
        обставинами непереборної сили, тобто, подіями або обставинами, які
        дійсно знаходяться поза контролем такої Сторони, що настали після
        укладення цього Договору та носять непередбачений і невідворотний
        характер.
    </p>
    <p>
        10.2. До форс-мажорних обставин та/або обставинами непереборної сили
        належать, зокрема, природні катаклізми, страйки, пожежі, повені, вибухи,
        обмерзання, війни (як оголошені, так і неоголошені), заколоти, псування
        мережі інтернет та засобів телекомунікацій, викликані аваріями або
        несприятливими, погодними умовами, небезпеки і випадковості, ембарго,
        катастрофи, обмеження, що накладаються державними органами (включаючи
        розподілу, пріоритети, офіційні вимоги, квоти і ціновий контроль, тощо),
        якщо ці обставини безпосередньо вплинули на виконання цього Договору.
    </p>
    <p>
        10.3.Сторона, для якої стало неможливим виконання зобов’язань за цим
        Договором через настання форс-мажорних обставин та/або обставин
        непереборної сили, повинна негайно інформувати іншу Сторону про
        виникнення вищевказаних обставин, а також протягом 30 (тридцяти)
        календарних днів надати іншій Стороні підтвердження таких обставин.
        Таким підтвердженням буде довідка, сертифікат або інший відповідний
        документ, виданий уповноваженим державним органом, розташованим за
        місцем виникнення форс-мажорних обставин та/або обставин непереборної
        сили.
    </p>
    <p>
        10.4. Час, який потрібен Сторонам для виконання своїх зобов’язань за цим
        Договором, буде продовжено на будь-який термін, протягом якого було
        відкладено виконання зобов'язань через вищеперераховані обставини.
    </p>
    <p>
        10.5. Якщо через форс-мажорних обставин та/або дію обставин непереборної
        сили невиконання зобов’язань за цим Договором триває більше трьох
        місяців, кожна із Сторін має право розірвати цей Договір в
        односторонньому порядку, письмово повідомивши про це іншу сторону.
    </p>
    <p>
        Незважаючи на настання форс-мажорних обставин та/або дію обставин
        непереборної сили, перед припиненням цього Договору внаслідок таких
        обставин, Сторони здійснюють остаточні взаєморозрахунки.
    </p>
    <p>
        <br />
    </p>
    <h3>11.ІНШІ УМОВИ ДОГОВОРУ</h3>
    <p>
        11.1. Інформація про Замовника використовується в цілях виконання його
        Замовлення, надсилання пропозицій та інформаційних матеріалів Виконавця
        та/або розміщення відгуків Замовника про надані послуги Виконавцем, у
        разі їх наявності.
    </p>
    <p>
        11.2. Власним акцептування Договору або реєстрацією на Веб-сайті
        https://yogafaynyy.com Замовник, підтверджує, що він повідомлений про
        включення його персональних даних до бази персональних даних,
        володільцем якої є Виконавець, з метою обробки персональних даних,
        зазначеної у цьому пункті, а також про свої права, зазначені у статті 8
        Закону України «Про захист персональних даних».
    </p>
    <p>
        Замовник добровільно надає згоду на збір та обробку власних персональних
        даних з наступною метою: дані, що стають відомі використовуватимуться в
        комерційних цілях, в тому числі для обробки замовлень на придбання
        Послуг, отримання інформації про Замовлення, надсилання
        телекомунікаційними засобами зв’язку (електронною поштою, мобільним
        зв’язком) рекламних та спеціальних пропозицій, інформації про акції,
        розіграші або будь-якої іншої інформації про діяльність Виконавця.
    </p>
    <p>
        Для цілей, передбачених цим пунктом, Замовнику мають право направлятися
        листи, повідомлення та матеріали на поштову адресу, e-mail Замовника, а
        також відправлятися sms-повідомлення, здійснюватися дзвінки на вказаний
        в Замовлені та/або анкеті телефонний номер.
    </p>
    <p>
        11.3. Замовник дає право здійснювати обробку його персональних даних, у
        тому числі: поміщати персональні дані в бази даних (без додаткового
        повідомлення про це), здійснювати довічне зберігання даних, їх
        накопичення, оновлення, зміну (у міру необхідності). Виконавець бере на
        себе зобов’язання забезпечити захист даних від несанкціонованого доступу
        третіх осіб, не поширювати і не передавати дані будь-якій третій стороні
        (крім передачі даних пов’язаним особам, комерційним партнерам, особам,
        уповноваженим Виконавцем на здійснення безпосередньої обробки даних для
        зазначених цілей, а також на обов’язковий запит компетентного державного
        органу).
    </p>
    <p>
        11.4. У випадку небажання отримувати розсилку, Замовник має право
        звернутися до Виконавця, написавши про відмову від отримання рекламних
        та/або інформаційних матеріалів, надіславши його на поштову або
        електронну адресу.
    </p>
    <p>
        11.5. Виконавець не несе відповідальність за зміст і правдивість
        інформації, що надається Замовником при оформленні замовлення.
    </p>
    <p>
        11.6. За винятком гарантій, прямо зазначених у тексті Оферти, Виконавець
        не надає жодних інших прямих або домислюваних гарантій за Договором і
        прямо відмовляється від будь-яких гарантій та/або умов відносно
        збереження прав, відповідності Послуг конкретним цілям Замовника.
    </p>
    <p>
        11.7. Погоджуючись з умовами та приймаючи умови цієї Оферти шляхом
        Акцепту Оферти, Замовник (чи представник Замовника, в т. ч. фізична
        особа, належним чином уповноважена укласти Договір від імені Замовника)
        запевняє Виконавця і гарантує Виконавцю, що:
    </p>
    <p>
        11.7.1. Замовник (представник Замовника) надав достовірні дані, у тому
        числі персональні дані Замовника (представника Замовника) для оформлення
        платіжних документів з оплати Послуг.
    </p>
    <p>
        11.7.2. Замовник укладає Договір добровільно, при цьому Замовник
        (представник Замовника):
    </p>
    <p>a. повністю ознайомився з умовами Оферти,</p>
    <p>
        b. повністю розуміє предмет Оферти та Договору, c. повністю розуміє
        значення та наслідки своїх дій щодо укладання та виконання Договору.
    </p>
    <p>
        11.7.3. Замовник (представник Замовника) має всі права та повноваження,
        необхідні для укладання та виконання Договору.
    </p>
    <p>
        <br />
    </p>
    <h3>11.7.4</h3>
    <p>АДРЕСА ТА РЕКВІЗИТИ ВИКОНАВЦЯ</p>
    <p>ФІЗИЧНА ОСОБА ПІДПРИЄМЕЦЬ МОСКАЛЕЦЬ СЕРГІЙ РОМАНОВИЧ</p>
    <h3>19003 ВУЛ.ГЕРОЇВ ДНІПРА 35 КВ. 237</h3>
    <p>ЄДРПОУ 3569803798</p>
    <p>Р/р UA613220010000026006340034230</p>
    <p>АТ «УНІВЕРСАЛ БАНК» Ліцензія НБУ</p>
    <p>тел.: (073) 486 23 03, faynyyyoga@gmail.com</p>
    <p>Є платником єдиного податку 3 групи</p>
</div>

<style>
    * {
        line-height: 1.5;
    }

    p {
        font-weight: 300;
    }

    h1 {
        font-size: 32px;
        margin-top: 20px;
        margin-bottom: 24px;
    }
    h2 {
        font-size: 28px;
        margin-top: 20px;
        margin-bottom: 20px;
    }
    h3 {
        font-size: 24px;
        margin-top: 20px;
        margin-bottom: 15px;
    }
    h4 {
        font-size: 20px;
        margin-top: 20px;
        margin-bottom: 10px;
    }
    h5 {
        font-size: 18px;
        margin-top: 20px;
        margin-bottom: 8px;
    }
    h6 {
        font-size: 16px;
        margin-top: 20px;
        margin-bottom: 5px;
    }

    a {
        color: var(--brand);
    }

    strong::after {
        content: ' ';
    }
</style>
