<script>
	import Btn from '$lib/ui/Btn.svelte';
    const content = [
        {
            question: "Чи є протипоказання для занять йогою?",
            answer: /* html */`
                <p>
                    Для того, щоб займатися йогою - тобі не потрібно бути гнучкою людиною, або
                    спортсменом. Йогою може займатися абсолютно кожен, незалежно від віку та ступеню підготовки
                </p>
            `
        },
        {
            question: "Що я отримаю від цих практик та для чого це мені?",
            answer: /* html */`
                <p>Позбудешся тривоги та стресу</p>
                <br>
                <ul>
                    <li>Перепрограмуєш власні деструктивні думки, установки та ствердження</li>
                    <li>Прокачаєш своє тіло. Якісна можливість укріпити мʼязовий корсет та опорно-руховий апарат</li>
                    <li>Вилікуєш десятки хвороб</li>
                    <li>Позбудешся станів депресії та апатії</li>
                    <li>Навчишся жити тут і зараз</li>
                    <li>Отримаєш внутрішню цілісність та свободу</li>
                    <li>Позбавишся харчових залежностей та звичок</li>
                    <li>Отримаєш нових друзів та якісну спільноту мотивованих людей</li>
                    <li>Віднайдеш свої істинні цілі</li>
                </ul>
            `
        },
        {
            question: "В мене мало часу для цього… Чи можна практикувати в будь-який час?",
            answer: /* html */`
                <p>
                    В дні 1440 хвилин. Тобі потрібно максимум 40. Ти маєш можливість обрати для себе зручний час та день, все що тобі потрібно - мати телефон та бажання.
                    <br>
                    Ми надаємо тобі якісні та унікальні інструменти, супроводжуємо тебе в цьому та
                    підтримуємо.
                    <br>
                    Практикуй коли тобі зручно, або долучайся до спільноти “YOGA сімʼя” та працюй над собою у колі однодумців, це мотивує та пришвидшує результат
                </p>
            `
        },
        {
            question: "Це точно не якась секта або релігія?",
            answer: /* html */`
                <p>
                    Секта в перекладі це “вчення” і концентрація на вивчені певних інтересів. Це не стосується релігії або віросповідань. Йога це перш за все - дисципліна та вчення про нас і про наш світ. “Хатха” в перекладі - це зусилля, узда, упряжка для розуму, а все інше лише вигадки. Йога – корисна й цікава практика, що покращує фізичний та емоційний стан. Практики Йоги допоможуть з визначенням власних цілей та цінностей, позбавлять тебе затисків у тілі та навіть мотивують до духовного розвитку.
                    <br><br>
                    Щодо медитації, Медитація - це один з інструментів який допомагає тобі почуватися краще як фізично, так і психологічно, формувати цілісний запит на розвиток та утримувати свою увагу та концентрацію на обʼєктах для глибинного пізнання. Тому, Вай Нот?
                </p>
            `
        },
        {
            question: "Чи можу я травмуватися по ваших уроках?",
            answer: /* html */`
                <p>
                    В хатха-йозі ми не женемось за результатом, а отримуємо “стан” та зцілення. В данних комплексах ми приділяємо значну увагу роботі з глибинними мʼязами та “сплячими зонами” в тілі. Тільки в хатха-йозі є етап відпочинку та інтегрування набутого досвіду в кінці практики, щоб тіло, психіка та розум прийшли до рівного та спокійного стану. Щоб спина та шия не боліла ми тренуємо мʼязи стабілізатори які тримають хребет у рівному стані в вертикальному положенні протягом усього дня Поєднання динаміки та статики, закачки, витяжіння та компенсації. Принципи та послідовність асан підібрані ідеально та базуються на трьох постулатах: безпечність, ефективність та простота. 
                    Ми не виконуємо занадто складних асан, не стоїмо в стійках на голові, не робимо “собаку мордою вгору” та навіть не закручуємо ноги в лотос.
                    Не співаємо мантри та нікому не молимося.
                    <br><br>
                    Тільки комплексна робота з ювелірною послідовністю базових асан у звʼязці з концентрацією на диханні гарантує людині, систематичний і стрімкий результат, налаштування усіх тілесних процесів та виходу на більш високі рівні світосприйняття
                    Памʼятайте, ви молоді поки гнучкий ваш хребет

                </p>
            `
        },
        {
            question: "Чим FYSM як методологія відрізняється від інших напрямків у Йозі?",
            answer: /* html */`
                <p>
                    — FYSM враховує особливості, цілі та стан будь-якого практика шляхом багатогранності комбінаційних алгоритмів та тренувального процесу. Методологія заснована на 15-ти річному досвіді особистої практики та тренерського досвіду вчителя. Алгоритми та комбінації були перевірені більше ніж на 100+ тисячах людях
                    <br><br>
                    Завдяки системі - практик отримує космічні результати в короткі терміни. 
                    Навіть якщо людина виконує не на всі 100% або не зовсім геометрично правильно, вона неодмінно отримає позитивний результат.
                    Методологія працює за принципом Парето 20% зусиль та 80% результату.
                </p>
            `
        },
        {
            question: "Якщо я зовсім недосвідчений новачок, то я можу спробувати?",
            answer: /* html */`
                <p>
                    Є два варіанти - ти або підсів, або ще не спробував…
                    <br><br>
                    — Методологію FYSM може використовувати кожен, незалежно від часу, простору та обставин, клімату, віросповідань, віку та будови тіла. Навіть якщо практик виконує асани з неточністю і без особливої техніки, то він не отримає фізичну або психічну травму, яку часто отримують шляхом “інтуїтивного” або “класичного” методу. 
                    Якщо коротко - то ФІСМ можна рекомендувати навіть мамі та найріднішим людям не переймаючись за кінцевий результат

                </p>
            `
        },
        {
            question: "Як швидко я отримаю результат?",
            answer: /* html */`
                <p>
                    – Швидко це - повільно та регулярно. Шлях кожного починається з сумнівів та внутрішніх заперечень..
                    В йогу не приходять від “прекрасного життя” Якщо ви втомились активно шукати вихід, інструменти досягнення успіху, стояти на місці, набивати власні "синці" та вас повністю не влаштовує ваше життя і світ навколо вас, проте всередині ще не згас внутрішній вогонь, надія і Віра що може бути по-іншому - то
                    Вам доведеться довіритися процесу, здатися і почати діяти
                    <br><br>
                    Ви не просто купуєте платформу, ви отримуєте інструмент, провідника та поле для швидких та якісних трансформацій
                </p>
            `
        },
        {
            question: "Як проходять  заняття?",
            answer: /* html */`
                <p>
                    – Платформа інтуїтивна та інтерактивна і підійде за зручністю кожному. 
                    Після купівлю платформи, ви отримуєте доступ і вам надсилаються відеоуроки з текстовим супроводом за якими ви можете практикувати. Весь час з вами на звʼязку служба турбота, чат активності учасників та викладачів йоги. 
                    <br><br>
                    Памʼятайте - лише в регулярній практиці секрет успіху.
                </p>
            `
        },
        {
            question: "Спортзал, качалка, стретчинг і Йога, в чому різниця?",
            answer: /* html */`
                <p>
                    Є дві крайності: тільки качатися в тренажерках та тільки розтягуватися
                    Перше призводить до гіпертонусу в мʼязах, втраті мобільності суглобів та перевантаженню кровоносної та дихальної систем. 
                    Якщо ви приймаєте якісь “бади” чи “добавки” то у вас будуть проблеми з нирками, підшлунковою залозою, печінкою, статевими залозами та репродуктивними функціями. 
                    <br><br>
                    У випадку з розтяжкою у вас страждають суглоби, випадають плечі, тазостегнові суглоби, травмуються мʼязи, звʼязки та сухожилля
                    Що призводить тіло в баланс? Система тренувань на закачку,  компенсацію м'язового корсета та опорно-рухового апарату.
                    <br><br>
                    Стабілізація та балансування потоків енергії, грамотне перетікання рідин у тілі та процес еволюції свідомості, при цьому Вам потрібен лише килимок та простір 2х2 метри. 
                </p>
            `
        },
        {
            question: "Як працює Йога?",
            answer: /* html */`
                <p>
                    Йога це найвища, цілісна система про усі аспекти життя та світобудову людини. 
                    Йога дає шанс взяти під контроль своє тіло, емоції та розум. 
                    Йога викорінює коливання хаотичного розуму
                    Крім здорової спини, прекрасного самопочуття, чистої свідомості та цілісності, людина отримує внутрішній стержень, впевненість та бачення чогось більшого ніж власне я. 
                    <br><br>
                    В період занепаду та приспаної чистоти свідомості Йога - єдине що має сенс.
                    <br><br>
                    – Йога це магічна технологія самопізнання і розкриття власних особливостей. Хоч цей шлях тяжкий та небезпечний, нехай Йога відкриє свої двері тому, хто старанно слідує її принципам, активно практикує незалежно від віку та обставин
                    <br>
                    <b>© Ігорь К</b>
                </p>
            `
        },
        
    ]

   
    

    function createAccordeon(node) {
        const wrapper = document.querySelector(".answer_wrapper")

        const find = (el, sel) => el.querySelector(sel)
        let list = node.children
        
        for (const elem of list) {
            const title   = find(elem, ".acc_title")
            const content = find(elem, ".acc_cnt")
            const height  = content.scrollHeight + "px"

            title.addEventListener("click", function() {
                if (innerWidth > 768) return

                for (const elem2 of list) {
                    if (elem2 !== elem) {
                        find(elem2, ".acc_cnt").style.maxHeight = 0
                        elem2.classList.remove("active")
                    }
                }

                content.style.maxHeight = elem.classList.toggle("active") ? height : 0
                
            })

            title.addEventListener("mouseenter", function() {
                if (innerWidth < 768) return

                const answer = document.querySelector(".answer_content") 
                answer.innerHTML = content.innerHTML
                wrapper.classList.add("active")
            })

            title.addEventListener("mouseleave", function() {
                if (innerWidth < 768) return

                const answer = document.querySelector(".answer_content") 
                answer.innerHTML = ""
                wrapper.classList.remove("active")
            })

            content.style.maxHeight = "0px"
            content.style.transition = "all 300ms"
        }
    }
</script>

<section class="bg-#292929 mt-50" id="faq">
    <div class="container py-50" flex="50 col center">
        <h2 class="title" data-aos="fade-down">Виникли питання?</h2>

        <div flex="50 m-md:col" class="answer_wrapper">
            <div
                flex="col"
                class="md:w-50%"
                use:createAccordeon
                data-aos="fade-up" data-aos-delay="0"
            >
                {#each content as {question, answer}}

                    <div class="w-full">
                        <div class="acc_title p-15 pointer" flex="10 space">
                            <p>{question}</p>
                            <img class="m-md:rotate-90" src="/icon/arrow.svg" alt="">
                        </div>
                        <div class="acc_cnt over-hidden" style="max-height: 0px">
                            <p class="p-15 op-60 fs-14 lh-1.2">{@html answer}</p>
                        </div>
                    </div>

                {/each}
            </div>

            <div class="answer_content md:w-50% m-md:hide!" text="m-md:14 lh-1.5"></div>

            <div
                class="answer_bot md:rel md:w-50%"
                data-aos="fade-up" 
                data-aos-delay="100"
            >

                

                <div class="answer_bot md:abs m-md:max-w-400 m-auto h-full" flex="20 col center">
                    <p text="20 bold center">
                        Сумніваєтесь та маєте питання? Напишіть в нашу службу турботи, ми допоможемо вам
                    </p>
    
                    <p text="14 center">
                        Перейдіть до нашого бота натисніть “Поставити питання” та напишіть що вас цікавить, в найближчий час ви отримаєте відповідь
                    </p>
    
                    <Btn text="@yoga_help" href="https://t.me/yoga_help" icon="/icon/tg.svg" cls="px-30" />
                </div>
            </div>
        </div>
    </div>
</section>

<style>
    .answer_content {
        /* position: absolute;
        top: 0;
        left: 0;
        width: 100%;
        height: 100%; */
        /* background: #292929; */
        /* display: flex;
        flex-direction: column;*/
        /* justify-content: center; 
        align-items: center;
        z-index: 1; */
        /* text-align: center; */
        /* padding: 30px */
    }
    .answer_content:empty {
        display: none;
    }
    
    .answer_wrapper:global(.active) .answer_bot {
        display: none;
    }

    @media (max-width: 768px) {
        :global(.active) .acc_title img {
            transform: rotate(180deg);
        }
    }
</style>
